cases/static_mixer/staticMixer/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters"

convertToMeters 1;

length  #calc "$lengthOverDiameter*4";
height	#calc "$length*sin($angle)";
width	#calc "$length*cos($angle)";
a	    #calc "2+$width";
b	    #calc "4+$width";
c	    #calc "2-$height";
d   	#calc "round((2-$height)/0.05)";
e   	#calc "round($height/0.05)";

vertices
(
  (0 0 0)
  (15 0 0)
  (15 2 0)
  (0 2 0)
  (0 0 0.1)
  (15 0 0.1)
  (15 2 0.1)
  (0 2 0.1)     //*7
  (2 2 0)
  (2 2 0)
  (2 2 0.1)
  (2 2 0.1)
  ($a $c 0)
  ($a $c 0.1)      //*13
  (4 2 0)
  (4 2 0)
  (4 2 0.1)
  (4 2 0.1)
  ($b $c 0)
  ($b $c 0.1)   //*19
  (0 $c 0)
  (0 $c 0.1)
  (15 $c 0)
  (15 $c 0.1)
  ($a 0 0)
  ($a 0 0.1)
  ($b 0 0)
  ($b 0 0.1)    //*27
);


blocks
(
    hex (20 12 8 3 21 13 10 7) (40 $e 1) simpleGrading (1 1 1)
    hex (0 24 12 20 4 25 13 21) (40 $d 1) simpleGrading (1 1 1)
    hex (12 18 14 9 13 19 16 11) (40 $e 1) simpleGrading (1 1 1)
    hex (24 26 18 12 25 27 19 13) (40 $d 1) simpleGrading (1 1 1)
    hex (18 22 2 15 19 23 6 17) (220 $e 1) simpleGrading (1 1 1)
    hex (26 1 22 18 27 5 23 19) (220 $d 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 21 20)
	    (7 3 20 21)
	        
        );
    }
    outlet
    {
	    type patch;
	    faces
	    (
	        (2 6 23 22)
            (1 22 23 5)
	    );
    } 
    fixedWalls
    {
        type wall;
        faces
        (
            (3 7 10 8)
            (9 11 16 14)
            (15 17 6 2)
        );
    }
    front
    {
        type symmetry;
        faces
        (
            (3 8 12 20)
            (20 12 24 0)
            (9 14 18 12)
            (12 18 26 24)
            (15 2 22 18)
            (18 22 1 26)
        );
    }
    back
    {
        type symmetry;
        faces
        (
            (10 7 21 13)
            (13 21 4 25)
            (16 11 13 19)
            (19 13 25 27)
            (6 17 19 23)
            (23 19 27 5)
        );
    }
    baffleWalls
    {
        type wall;
        faces
        (
            (8 10 13 12)
            (9 12 13 11)
            (14 16 19 18)
            (15 18 19 17)
        );
    }

    axis
    {
        type symmetryPlane;
        faces
        (
            (0 24 25 4)
            (24 26 27 25)
            (26 1 5 27)
        );
    }

);
mergePatchPairs
(
);


// ************************************************************************* //
