cases/static_mixer/staticMixer/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 14.855;

boundaryField
{
    inlet
    {
        type            turbulentMixingLengthDissipationRateInlet;
	    mixingLength    0.152;
        value           uniform 14.855;
    }

    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            epsilonWallFunction;
        value           uniform 14.855;
    }

    baffleWalls
    {
	    type            epsilonWallFunction;
        value           uniform 14.855;
    }

    
 #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
