cases/static_mixer/staticMixer/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../parameters"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       $turbulentIntensity;
        value           uniform 0.375;
    }

    outlet
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            kLowReWallFunction;
        value           uniform 0.375;
    }

    baffleWalls
    {
	    type            kLowReWallFunction;
        value           uniform 0.375;
    }

 #includeEtc "caseDicts/setConstraintTypes"
}


// ************************************************************************* //
