cases/static_mixer/staticMixer/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        tolerance       1e-06;
        relTol          0.05;
	smoother        GaussSeidel;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-05;
        relTol          0;
    }
    Tracer
    {
        solver		PBiCGStab;
	preconditioner	DILU;
	tolerance	1e-06;
	relTol		0;
    }


}

SIMPLE
{
    nNonOrthogonalCorrectors 0;

    residualControl
    {
        p               1e-3;
        Ux              1e-5;
	Uy		1e-4;
	Uz		1e-1;
	Tracer		1e-5;
	"(k|epsilon|omega)"	5e-4;
    }
}

relaxationFactors
{
    fields
    {
	p		0.3;
	Tracer		0.3;
    }
    equations
    {
	U		0.7;
	k		0.7;
	"(epsilon|omega)"		0.7;
    }
}



// ************************************************************************* //
